#Γέροντας Αλέξανδρος 321/2015029

.data #δεδομένα 

str1: .asciiz "Insert number 1:\n" # Δήλωση του str1
str2: .asciiz "Insert number 2:\n" # Δήλωση του str2
str3: .asciiz "The result of the subtraction is\n" # Δήλωση str3

.text # Το πρόγραμμα τοποθετείται κάτω απο το.text

main: # Κυρίως πρόγραμμα 

la $a0, str1 # Αποθήκευση διεύθυνσης str1 στο καταχωρητή a0 
li $v0, 4 # Κλήση για εκτέλεση εκτύπωσης string
syscall #  Εκτέλεση

li $v0, 5 # Κλήση για διάβασμα ακεραίου  
syscall # Εκτέλεση
move $t0, $v0 # Αποθήκευση της τιμής στον καταχωρητή t0

la $a0, str2 #  Αποθήκευση διεύθυνσης str2 στο καταχωρητή a0 
li $v0, 4 # Κλήση για εκτέλεση εκτύπωσης string
syscall # Εκτέλεση

li $v0, 5 # Κλήση για διάβασμα ακεραίου
syscall # Εκτέλεση
move $t1, $v0 # Αποθήκευση της τιμής στον καταχωρητή t1

la $a0, str3 #  Αποθήκευση διεύθυνσης str3 στο καταχωρητή a0 
li $v0, 4 # Κλήση για εκτέλεση εκτύπωσης  string
syscall # Εκτέλεση

sub $t0, $t0, $t1 #Εκτέλεση της πράξης αφαίρεσης 

move $a0, $t0 # Αποθήκευση της τιμής του t0 στον καταχωρητή a0
li $v0, 1 #  Κλήση για εκτέλεση εκτύπωσης int
syscall #  Εκτέλεση

li $v0, 10 # Κλήση για έξοδο
syscall #  Εκτέλεση