#Γέροντας Αλέξανδρος 321/2015029


.data #δεδομένα 

str1: .asciiz "Alexandros\n" #Δήλωση του str1
str2: .asciiz "321/2015029\n" # Δήλωση του str2

.text # Το πρόγραμμα τοποθετείται κάτω απο το.text

main: # Κυρίως πρόγραμμα 

la $a0, str1 # Αποθήκευση διεύθυνσης str1 στο καταχωρητή a0 
li $v0, 4 # Κλήση για εκτέλεση εκτύπωσης string
syscall # Εκτέλεση

la $a0, str2 # Αποθήκευση διεύθυνσης str2 στο καταχωρητή a0 
li $v0, 4 # Κλήση για εκτέλεση εκτύπωσης string 
syscall # Εκτέλεση

li $v0, 10 # Κλήση για έξοδο
syscall #  Εκτέλεση