# Γέροντας Αλέξανδρος 321/2015029

# Δήλωση μεταβλητών
.data 
	msg0: .asciiz "Dose ton 1o arithmo: " # Δήλωση του msg0
	msg1: .asciiz "Dose ton 2o arithmo: " # Δήλωση του msg1
	msg2: .asciiz "To apotelesma tis afairesis einai: " # Δήλωση του msg2

# Το πρόγραμμα τοποθετείται κάτω απο το .text
.text

# Κυρίως πρόγραμμα 
main: 
	la $a0,msg0 # Αποθήκευση διεύθυνσης msg0 στο καταχωρητή a0 
	li $v0,4 # Κλήση για εκτέλεση εκτύπωσης string	
	syscall # Εκτέλεση
	
	li $v0,5 # Κλήση για διάβασμα ακεραίου  
	syscall # Εκτέλεση		
	move $t0,$v0 # Αποθήκευση της τιμής στον καταχωρητή t0
		
	la $a0,msg1 # Αποθήκευση διεύθυνσης msg1 στο καταχωρητή a0 
	li $v0,4 # Κλήση για εκτέλεση εκτύπωσης string	
	syscall # Εκτέλεση

	li $v0, 5 # Κλήση για διάβασμα ακεραίου
	syscall # Εκτέλεση	
	move $t1,$v0 # Αποθήκευση της τιμής στον καταχωρητή t1
	sub $t0, $t0, $t1 #Εκτέλεση της πράξης αφαίρεσης 
	
	la $a0,msg2 # Αποθήκευση διεύθυνσης msg2 στο καταχωρητή a0 
	li $v0,4 # Κλήση για εκτέλεση εκτύπωσης string	
	syscall # Εκτέλεση

	move $a0,$t0 # Αποθήκευση της τιμής του t0 στον καταχωρητή a0	
	li $v0,1 # Κλήση για εκτέλεση εκτύπωσης int 	
	syscall # Εκτέλεση
	
	li $v0,10 # Κλήση για έξοδο
	syscall # Εκτέλεση
