#icsd15029 Γέροντας Αλέξανδρος

.data																			# Ακολουθεί δήλωση των string.
	str: .asciiz " Dose ton proto oro: "
	str1: .asciiz "\n Dose to vima tis arithmitikis proodou: "
	str2: .asciiz " "
	str3: .asciiz "\n\n >> To athroisma ton 20 oron tis akolouthias einai: "
	str4: .asciiz"\n >> "
	array: .word 0:20															#Δήλωση και αρχικοποίηση πίνακα 20 θέσεων τύπου ακεραίου.
	sum: .word 0																#Δήλωση μεταβλητής. 

.text
main:
	la $a0, str 																#Καταχώρηση string στον καταχωρητή $a0.
	li $v0, 4																	#Εμφάνιση string στην κονσόλα.
	syscall
	
	li $v0, 5																	#Ανάγνωση integer από το χρήστη για την πρώτη τιμή της ακολουθίας.
	syscall
	
	move $t1, $v0																#Kαταχώρηση του ακεραίου που αναγνώστηκε στoν καταχωρητή $t1.
	sw $t1, array($t0)															#Καταχώρηση της τιμής του $t1 στο πρώτο στοιχείο του πίνακα.
	
	la $a0, str1 																#Καταχώρηση string στον καταχωρητή $a0.
	li $v0, 4																	#Εμφάνιση string στην κονσόλα του QTSPIM.
	syscall
	
	li $v0, 5																	#Ανάγνωση integer από το χρήστη για το βήμα της αριθμητικής προόδου.
	syscall
	
	move $s0, $v0																#Kαταχώρηση του ακεραίου που αναγνώστηκε στoν καταχωρητή $s0.
	li $s1, 19																	#Αρχικοποίηση μετρητή για την create_array.
	li $t3,4																	#Αρχικοποίηση δείκτη θέσης πίνακα.
	move $t2, $t1																#Έναρξη μέτρησης του αθροίσματος.
	
	create_array:
		add $t1, $t1, $s0														#Υπολογισμός εκάστοτε επόμενης τιμής της αριθμητικής προόδου.
		sw $t1, array+0($t3)													#Καταχώρηση τιμής στην αντίστοιχη θέση του πίνακα.
		add $t2, $t2, $t1														#Υπολογισμός του αθροίσματος.
		add $t3,$t3, 4															#Αύξηση δείκτη θέσης του πίνακα.
		addi $s1, $s1, -1														#Μείωση μετρητή επανάληψης.
		bgt	$s1, $zero, create_array											#Συνθήκη τερματισμού create_array.
			
	sw $t2, sum																	#Καταχώρηση αθροίσματος σε μεταβλητή.
	li $s1, 20																	#Δημιουργία μετρητή για τη show_array.
	li $t3, 76																	#Αρχικοποίηση δείκτη θέσης πίνακα.
	
	la $a0, str4																#Καταχώρηση string στον καταχωρητή $a0.
	li $v0, 4																	#Εμφάνιση string στην κονσόλα του QTSPIM.
	syscall
											
	show_array:		
		lw $t0, array+0($t3)													#Φόρτωση στον καταχωρητή $t0 της εκάστοτε τιμής του πίνακα, από τη θέση που δείχνει ο εκάστοτε δείκτης.
		
		la $a0, str2 															#Καταχώρηση string στον καταχωρητή $a0.
		li $v0, 4																#Εμφάνιση string στην κονσόλα του QTSPIM.
		syscall
		
		li $v0, 1													
		move $a0, $t0															#Εμφάνιση τιμής του καταχωρητή $t0.						
		syscall		
		
		addi $s1, $s1, -1														#Μείωση του μετρητή επανάληψης.
		add $t3,$t3, -4															#Μείωση του δείκτη θέσης πίνακα.
		bgt $s1, $zero, show_array												#Συνθήκη τερματισμού show_array.	
														
	la $a0, str3 																#Καταχώρηση string στον $a0.
	li $v0, 4																	#Εμφάνιση string στην κονσόλα του QTSPIM.
	syscall	
	
	li $v0, 1																	#Eμφάνιση του αθροίσματος.
	move $a0, $t2																#Εμφάνιση της τιμής που περιέχει ο καταχωρητής $t2.
	syscall
		
	li $v0, 10 																	#Tερματισμός προγράμματος.									
	syscall
